Version2/TestTool-NOP.13.12.SR1/TestTool.Setup/Requests/DeviceManagement/SetUser/TC.DM.NVT.30_REQ_08.xml

<?xml version='1.0' encoding='utf-8'?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
               xmlns:tds="http://www.onvif.org/ver10/device/wsdl"
               xmlns:tt="http://www.onvif.org/ver10/schema">
  <soap:Body>
    <tds:SetUser>
      <tds:User>
        <tt:Username>TestAdmin2</tt:Username>
        <tt:Password>123</tt:Password>
        <tt:UserLevel>Extended</tt:UserLevel>
      </tds:User>
    </tds:SetUser>
  </soap:Body>
</soap:Envelope>